niexuzhong/mm32gnuarm/include/MM32F031x4x6_q.h
#define  DMA_CCR2_MSIZE_8BIT                 ((uint16_t)0x0000)            /*!< MSIZE 8 bit */
#define  DMA_CCR2_MSIZE_16BIT                ((uint16_t)0x0400)            /*!< MSIZE 16 bit */
#define  DMA_CCR2_MSIZE_32BIT                ((uint16_t)0x0800)            /*!< MSIZE 32 bit */

#define  DMA_CCR2_PL                         ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR2_PL_0                       ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CCR2_PL_1                       ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CCR2_PL_LOW                     ((uint16_t)0x0000)            /*!< PL low*/
#define  DMA_CCR2_PL_MEDIUM                  ((uint16_t)0x1000)            /*!< PL medium */
#define  DMA_CCR2_PL_HIGH                    ((uint16_t)0x2000)            /*!< PL high */
#define  DMA_CCR2_PL_HIGHEST                 ((uint16_t)0x3000)            /*!< PL highest */

#define  DMA_CCR2_MEM2MEM                    ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*******************  Bit definition for DMA_CCR3 register  *******************/
#define  DMA_CCR3_EN                         ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CCR3_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CCR3_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CCR3_TEIE                       ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CCR3_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CCR3_CIRC                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CCR3_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CCR3_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CCR3_PSIZE                      ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR3_PSIZE_0                    ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CCR3_PSIZE_1                    ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CCR3_PSIZE_8BIT                 ((uint16_t)0x0000)            /*!< PSIZE 8 bit */
#define  DMA_CCR3_PSIZE_16BIT                ((uint16_t)0x0100)            /*!< PSIZE 16 bit */
#define  DMA_CCR3_PSIZE_32BIT                ((uint16_t)0x0200)            /*!< PSIZE 32 bit */


#define  DMA_CCR3_MSIZE                      ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CCR3_MSIZE_0                    ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CCR3_MSIZE_1                    ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CCR3_MSIZE_8BIT                 ((uint16_t)0x0000)            /*!< MSIZE 8 bit */
#define  DMA_CCR3_MSIZE_16BIT                ((uint16_t)0x0400)            /*!< MSIZE 16 bit */
#define  DMA_CCR3_MSIZE_32BIT                ((uint16_t)0x0800)            /*!< MSIZE 32 bit */


#define  DMA_CCR3_PL                         ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR3_PL_0                       ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CCR3_PL_1                       ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CCR3_PL_LOW                     ((uint16_t)0x0000)            /*!< PL low*/
#define  DMA_CCR3_PL_MEDIUM                  ((uint16_t)0x1000)            /*!< PL medium */
#define  DMA_CCR3_PL_HIGH                    ((uint16_t)0x2000)            /*!< PL high */
#define  DMA_CCR3_PL_HIGHEST                 ((uint16_t)0x3000)            /*!< PL highest */

#define  DMA_CCR3_MEM2MEM                    ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*!<******************  Bit definition for DMA_CCR4 register  *******************/
#define  DMA_CCR4_EN                         ((uint16_t)0x0001)            /*!<Channel enable */
#define  DMA_CCR4_TCIE                       ((uint16_t)0x0002)            /*!<Transfer complete interrupt enable */
#define  DMA_CCR4_HTIE                       ((uint16_t)0x0004)            /*!<Half Transfer interrupt enable */
#define  DMA_CCR4_TEIE                       ((uint16_t)0x0008)            /*!<Transfer error interrupt enable */
#define  DMA_CCR4_DIR                        ((uint16_t)0x0010)            /*!<Data transfer direction */
#define  DMA_CCR4_CIRC                       ((uint16_t)0x0020)            /*!<Circular mode */
#define  DMA_CCR4_PINC                       ((uint16_t)0x0040)            /*!<Peripheral increment mode */
#define  DMA_CCR4_MINC                       ((uint16_t)0x0080)            /*!<Memory increment mode */

#define  DMA_CCR4_PSIZE                      ((uint16_t)0x0300)            /*!<PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR4_PSIZE_0                    ((uint16_t)0x0100)            /*!<Bit 0 */
#define  DMA_CCR4_PSIZE_1                    ((uint16_t)0x0200)            /*!<Bit 1 */

#define  DMA_CCR4_PSIZE_8BIT                 ((uint16_t)0x0000)            /*!< PSIZE 8 bit */
#define  DMA_CCR4_PSIZE_16BIT                ((uint16_t)0x0100)            /*!< PSIZE 16 bit */
#define  DMA_CCR4_PSIZE_32BIT                ((uint16_t)0x0200)            /*!< PSIZE 32 bit */


#define  DMA_CCR4_MSIZE                      ((uint16_t)0x0C00)            /*!<MSIZE[1:0] bits (Memory size) */
#define  DMA_CCR4_MSIZE_0                    ((uint16_t)0x0400)            /*!<Bit 0 */
#define  DMA_CCR4_MSIZE_1                    ((uint16_t)0x0800)            /*!<Bit 1 */

#define  DMA_CCR4_MSIZE_8BIT                 ((uint16_t)0x0000)            /*!< MSIZE 8 bit */
#define  DMA_CCR4_MSIZE_16BIT                ((uint16_t)0x0400)            /*!< MSIZE 16 bit */
#define  DMA_CCR4_MSIZE_32BIT                ((uint16_t)0x0800)            /*!< MSIZE 32 bit */


#define  DMA_CCR4_PL                         ((uint16_t)0x3000)            /*!<PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR4_PL_0                       ((uint16_t)0x1000)            /*!<Bit 0 */
#define  DMA_CCR4_PL_1                       ((uint16_t)0x2000)            /*!<Bit 1 */

#define  DMA_CCR4_PL_LOW                     ((uint16_t)0x0000)            /*!< PL low*/
#define  DMA_CCR4_PL_MEDIUM                  ((uint16_t)0x1000)            /*!< PL medium */
#define  DMA_CCR4_PL_HIGH                    ((uint16_t)0x2000)            /*!< PL high */
#define  DMA_CCR4_PL_HIGHEST                 ((uint16_t)0x3000)            /*!< PL highest */

#define  DMA_CCR4_MEM2MEM                    ((uint16_t)0x4000)            /*!<Memory to memory mode */

